otel/tests/artillery/add-task.yml
config:
  # target: "wss://meteor35.meteorapp.com/websocket"
  target: "ws://localhost:8080/websocket"
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 15
      name: "Warm up"
    - duration: 60
      arrivalRate: 15
      rampTo: 30
      name: "Load increase"
    - duration: 120
      arrivalRate: 30
      name: "Peak load"
  engines:
    ws: {}
  processor: "./processors.js"

scenarios:
  - name: "add_tasks_subscription_cleanup"
    engine: ws
    flow:
      - function: "initSession"
      - function: "connectToDdp"
      - function: "subscribeLinks"
      - loop:
          - function: "insertTask"
          - think: "0.5s"
        count: 10
      - function: "clearSession"