otel/tests/artillery/combined-load.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 15
      name: "Sustained load"
  defaults:
    headers:
      Content-Type: "application/json"
      X-Request-Id: "{{ $uuid }}"
  plugins:
    expect: {}

scenarios:
  # HTTP API scenarios
  - name: "API: Health check"
    weight: 2
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "API: Get links"
    weight: 3
    flow:
      - get:
          url: "/api/links"
          expect:
            - statusCode: 200
      - think: 0.2
      - get:
          url: "/api/links/count"
          expect:
            - statusCode: 200

  - name: "API: Create link via HTTP"
    weight: 4
    flow:
      - post:
          url: "/api/links"
          json:
            title: "HTTP Created Link"
            url: "https://httptest.com/{{ $randomNumber(1, 99999) }}"
            timestamp: "{{ $timestamp }}"
          expect:
            - statusCode: 201
      - think: 0.3
      - get:
          url: "/api/links/count"
          expect:
            - statusCode: 200

  - name: "API: Slow endpoint with tracing"
    weight: 1
    flow:
      - get:
          url: "/api/slow?delay=200"
          expect:
            - statusCode: 200