otel/tests/artillery/http-endpoints.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 20
      name: "Sustained load"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Health check"
    weight: 3
    flow:
      - get:
          url: "/health"
          capture:
            - json: "$.status"
              as: "healthStatus"
          expect:
            - statusCode: 200
            - contentType: "application/json"

  - name: "Ready check"
    weight: 2
    flow:
      - get:
          url: "/ready"
          expect:
            - statusCode: 200
            - contentType: "application/json"

  - name: "Get links list"
    weight: 4
    flow:
      - get:
          url: "/api/links"
          capture:
            - json: "$.count"
              as: "linksCount"
          expect:
            - statusCode: 200
            - contentType: "application/json"

  - name: "Get links count"
    weight: 3
    flow:
      - get:
          url: "/api/links/count"
          capture:
            - json: "$.count"
              as: "totalCount"
          expect:
            - statusCode: 200
            - contentType: "application/json"

  - name: "Create and list links"
    weight: 5
    flow:
      - post:
          url: "/api/links"
          json:
            title: "Artillery Test Link"
            url: "https://example.com/{{ $randomNumber(1, 10000) }}"
            source: "artillery-test"
          capture:
            - json: "$.data._id"
              as: "createdLinkId"
          expect:
            - statusCode: 201
            - contentType: "application/json"
      - think: 0.5
      - get:
          url: "/api/links"
          expect:
            - statusCode: 200

  - name: "Slow endpoint test"
    weight: 1
    flow:
      - get:
          url: "/api/slow?delay=500"
          expect:
            - statusCode: 200
            - contentType: "application/json"